Repository: TheBlackSheep/ClipMan
Catalog: Other/languages/ClipMan.*.po
Languages: de

source: Credits go to;
de: Credits gehen;

source: the Awesome FPC/Lazarus team
de: die Awesome FPC / Lazarus Team

source: PilotLogic for CodeTyphon
de: PilotLogic für CodeTyphon

source: Carlo Kok (RemObjects) for the Open Source PascalScript
de: Carlo Kok (RemObjects) für die Open Source PascalScript

source: Written by TheBlackSheep using FreePascal && Lazarus
de: Geschrieben von TheBlackSheep mit FreePascal und Lazarus &

source: as a demonstration of some of the components and to
de: als eine Demonstration von einigen der Komponenten und

source: make something useful for all Pascal developers
de: machen etwas Nützliches für alle Pascal-Entwickler

source: (and other geeks) out there!
de: (Und andere Geeks) da draußen!

source: Free for all uses!
de: Frei für alle Anwendungen!

source: Please make suggestions for improvements!
de: Bitte machen Sie Vorschläge für Verbesserungen!

# englangres.msgallfiles
source: All files (*.*)|*.*
de: Alle Dateien (*.*)|*.*

# englangres.msgclipboardcleared
source: Clipboard cleared!
de: Zwischenablage gelöscht!

# englangres.msgclpbrdfrmtnotspprtdforscripts
source: Sorry, the clipboard contains data of a format that is currently unsupported for using with a script!
de: Leider enthält die Daten in der Zwischenablage von einem Format, das derzeit nicht unterstützt wird für die Verwendung mit einem Script!

source: Clipboard format not supported for scripts!
de: Das Format der Zwischenablage nicht für Skripte unterstützt!

# englangres.msgconfirmdelete
source: Are you sure you want to delete the script named
de: Sind Sie sicher, dass Sie das Skript mit dem Namen löschen

# englangres.msgerrorcompiling
source: Error compiling:
de: Fehler beim Kompilieren:

# englangres.msgformatnotrecognised
source: Sorry, unable to recognise that particular filetype!
de: Sorry, nicht in der Lage, die insbesondere filetype zu erkennen!

# englangres.msgformatnotrecognisedtitle
source: File format not recognised
de: Dateiformat nicht erkannt

# englangres.msgformatnotrecognisedtrytoload
source: Do you want to try and load it as a text file anyway?
de: Wollen Sie versuchen, und laden Sie sie als Textdatei überhaupt?

# englangres.msgimageformatnotsupported
source: Sorry, image type not supported
de: Sorry, Bild-Typ nicht unterstützt

# englangres.msgloadfiles
source: Text files (*.txt, *.csv, *.tab)|*.TXT;*.CSV;*.TAB|Images (*.bmp, *.jpg, *.png)|*.BMP;*.JPG;*.PNG;|All Files (*.*)|*.*
de: Text-Dateien (*. txt, *. csv *. tab) | *. TXT, *. CSV, *. TAB | Images (*. bmp, *. jpg, *. png) | *. BMP, *. JPG , *. PNG; | Alle Dateien (*.*)|*.*

# englangres.msgloadfiletitle
source: Load a file to the clipboard...
de: Legen Sie eine Datei in die Zwischenablage ...

# englangres.msgsaveimgclipboardfilter
source: Bitmap images (*.bmp)|*.BMP|JPEG Images (*.jpg)|*.JPG|Portable Network Graphic Image (*.png)|*.PNG|[Experimental] 256 Color Bitmap (*.bmp)|*.bmp|X Pixmap File (*.xpm)|*.XPM
de: Bitmap-Bilder (*. bmp) | *. BMP | JPEG Bilder (*. jpg) | *. JPG | Portable Network Graphic Image (*. png) | *. PNG | [Experimental] 256 Color Bitmap (*. bmp) | *. bmp | X Pixmap-Datei (*. xpm) | *. XPM

# englangres.msgsaveimgclipboardtitle
source: Save image on clipboard as...
de: Bild speichern auf Zwischenablage als ...

# englangres.msgsavetxtclipboardfilter
source: Text files (*.txt)|*.TXT|CSV Files (*.csv)|*.CSV|Tab Files (*.tab)|*.TAB
de: Text-Dateien (*. txt) | *. txt | CSV-Dateien (*. csv) | *. csv | Tab-Dateien (*. tab) | *. TAB

# englangres.msgsavetxtclipboardtitle
source: Save text on clipboard as...
de: Speichern von Text auf Zwischenablage als ...

source: A script with this name already exists!
de: Ein Skript mit diesem Namen existiert bereits!

# englangres.msgscriptexecutedsuccess
source: " executed ok!
de: "Ausgeführt ok!

# main.msgallfiles
source: All files (*.*)|*.*
de: Alle Dateien (*.*)|*.*

# main.msgclipboardcleared
source: Clipboard cleared!
de: Zwischenablage gelöscht!

# main.msgclpbrdfrmtnotspprtdforscripts
source: Sorry, the clipboard contains data of a format that is currently unsupported for using with a script!
de: Leider enthält die Daten in der Zwischenablage von einem Format, das derzeit nicht unterstützt wird für die Verwendung mit einem Script!

source: Clipboard format not support for scripts
de: Das Format der Zwischenablage nicht für Skripte unterstützen

# main.msgconfirmdelete
source: Are you sure you want to delete the script named
de: Sind Sie sicher, dass Sie das Skript mit dem Namen löschen

# main.msgerrorcompiling
source: Error compiling:
de: Fehler beim Kompilieren:

# main.msgformatnotrecognised
source: Sorry, unable to recognise that particular filetype!
de: Sorry, nicht in der Lage, die insbesondere filetype zu erkennen!

# main.msgformatnotrecognisedtitle
source: File format not recognised
de: Dateiformat nicht erkannt

# main.msgformatnotrecognisedtrytoload
source: Do you want to try and load it as a text file anyway?
de: Wollen Sie versuchen, und laden Sie sie als Textdatei überhaupt?

# main.msgimageformatnotsupported
source: Sorry, image type not supported
de: Sorry, Bild-Typ nicht unterstützt

# main.msgloadfiles
source: Text files (*.txt, *.csv, *.tab)|*.TXT;*.CSV;*.TAB|Images (*.bmp, *.jpg, *.png)|*.BMP;*.JPG;*.PNG;|All Files (*.*)|*.*
de: Text-Dateien (*. txt, *. csv *. tab) | *. TXT, *. CSV, *. TAB | Images (*. bmp, *. jpg, *. png) | *. BMP, *. JPG , *. PNG; | Alle Dateien (*.*)|*.*

# main.msgloadfiletitle
source: Load a file to the clipboard...
de: Legen Sie eine Datei in die Zwischenablage ...

# main.msgsaveimgclipboardfilter
source: Bitmap images (*.bmp)|*.BMP|JPEG Images (*.jpg)|*.JPG|Portable Network Graphic Image (*.png)|*.PNG|[Experimental] 256 Color Bitmap (*.bmp)|*.bmp|X Pixmap File (*.xpm)|*.XPM
de: Bitmap-Bilder (*. bmp) | *. BMP | JPEG Bilder (*. jpg) | *. JPG | Portable Network Graphic Image (*. png) | *. PNG | [Experimental] 256 Color Bitmap (*. bmp) | *. bmp | X Pixmap-Datei (*. xpm) | *. XPM

# main.msgsaveimgclipboardtitle
source: Save image on clipboard as...
de: Bild speichern auf Zwischenablage als ...

# main.msgsavetxtclipboardfilter
source: Text files (*.txt)|*.TXT|CSV Files (*.csv)|*.CSV|Tab Files (*.tab)|*.TAB
de: Text-Dateien (*. txt) | *. txt | CSV-Dateien (*. csv) | *. csv | Tab-Dateien (*. tab) | *. TAB

# main.msgsavetxtclipboardtitle
source: Save text on clipboard as...
de: Speichern von Text auf Zwischenablage als ...

# main.msgscriptexecutedsuccess
source: " executed ok!
de: "Ausgeführt ok!

source: About
de: Über

source: &Delete
de: & Löschen

source: &Edit
de: Und bearbeiten

source: Clipboard Manipulator
de: Zwischenablage Manipulator

# TFRMMAIN.CBSCRIPTCATEGORY.HINT
source: Type/choose a category for this script
de: Typ / wählen Sie eine Kategorie für dieses Skript

source: Category
de: Kategorie

# TFRMMAIN.DBGRIDSCRIPTS.COLUMNS[2].TITLE.CAPTION
source: Description
de: Beschreibung

source: Filter Category
de: Filter Kategorie

source: &About
de: & Über

source: An about box!
de: Eine Info-Box!

source: Clear the clipboard!
de: Deaktivieren Sie die Zwischenablage!

source: &Manage Scripts
de: & Scripts verwalten

source: Manage the saved scripts
de: Verwalten der gespeicherten Skripten

source: Close ClipMan completely!
de: Close clipman komplett!

source: &Load Clipboard from file
de: & Load Zwischenablage aus einer Datei

source: Load a file to the clipboard
de: Legen Sie eine Datei in die Zwischenablage

source: &Options
de: & Optionen

source: Configure options
de: Konfigurieren der Optionen

source: &Save Clipboard to file
de: & Save Zwischenablage in eine Datei

source: Save the clipboard to a file
de: Speichern Sie die Zwischenablage in eine Datei

source: Run a Script
de: Ausführen eines Skripts

# TFRMOPTIONS.BTNCANCEL.CAPTION
source: Cancel
de: Stornieren

source: Options
de: Optionen

source: Show modified contents of clipboard as balloon hint
de: Zeige modifizierten Inhalt der Zwischenablage als Ballon Hinweis

source: Period the hint is displayed (in secs)
de: Zeitraum der Hinweis angezeigt wird (in Sekunden)

source: Initial Script on "Add New"
de: Erste Script auf "Add New "

# TFRMSCRIPTEDITOR.BTNCANCEL.CAPTION
source: Cancel
de: Stornieren

source: Save Script
de: Skript speichern

# TFRMSCRIPTEDITOR.CBSCRIPTCATEGORY.HINT
source: Type/choose a category for this script
de: Typ / wählen Sie eine Kategorie für dieses Skript

source: Add a description (this will become the hint on the relevant menu option for this script!)
de: Fügen Sie eine Beschreibung (dies wird der Hinweis auf den entsprechenden Menüpunkt für dieses Skript zu werden!)

source: Provide a "memorable" name name for you're script, this will be the name of you're menu option!
de: Geben Sie einen "denkwürdigen " name für Sie script sind, wird dies der Name der du Menüpunkt werden!

# TFRMSCRIPTEDITOR.LBLDESCRIPTION.CAPTION
source: Description
de: Beschreibung

source: Output
de: Ausgang

source: Script Category
de: Script Kategorie

source: Script
de: Skript

source: Try out your test data here!
de: Testen Sie Ihre Testdaten hier!

source: Here you'll see the output (if you're lucky!)
de: Hier sehen Sie die Ausgabe (wenn man Glück hat!)

source: Click here to test your script!
de: Klicken Sie hier, um Ihr Skript zu testen!

source: You're new clipboard manipulating Pascal script can be written here!
de: Du bist neu Zwischenablage manipulieren Pascal Script hier geschrieben werden kann!

source: Splash
de: Spritzer
